opendata-heilbronn/modLED/STM32/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2019 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */

// TODO:
// Fix last Pixel dimly glowing
//    Adding dead-time should help 
// Gamma second implementation (full brightness, no global dimming.) 
//    Either by modifying PWM values, but would be losing resolution
//    Or by selecting the next PWM step to show by gamma (would mean rewrite of the current DMA logic)
// Maybe USB to Serial on-board? dunno, probably too complicated

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdbool.h>
#include <math.h>
#include <stdarg.h>
#include "globals.h"

//these includes are correctly handled during platform io build
// they probably won't work with the stock makefile, changes are needed
#include "wizchip_conf.h"
#include "socket.h"
#include "DHCP/dhcp.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
DMA_HandleTypeDef hdma_tim1_ch1;

UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_usart1_rx;
DMA_HandleTypeDef hdma_usart1_tx;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_SPI2_Init(void);
                                    
void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                
                                
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

//gamma generation playground: https://ideone.com/4WlJxv
void generateGammaTable() {
  for(int16_t i = 0; i < GAMMA_STEPS; i++) {
    uint16_t maxVal = (1 << PWM_RESOLUTION) - 1;
    float step = (float)i * (float)maxVal / 255.0;
    step = round(step);

    gammaTable[i] = (uint16_t)(pow(step / maxVal, GAMMA_CORRECTION) * maxVal); 
  }
}

void setGlobalBrightness(uint8_t brightness) {
  globalBrightness = brightness;
  __HAL_TIM_SET_COMPARE(&PWM_TIMER, PWM_CHANNEL, brightness);
}

void mapFrameBuf() {
  for(uint16_t y = 0; y < PANEL_HEIGHT; y++) {
    uint16_t rowIndex = y * PANEL_WIDTH;
    for(uint16_t x = 0; x < PANEL_WIDTH; x++) {
      uint16_t pixelIndex = rowIndex + x;
      uint32_t pixelColor = frameBuf[pixelIndex];

      // does not differentiate between upper and lower half
      uint16_t matrixIndex = ((x / 4) * 16) + ((y % 4) * 4) + (x % 4); 

      bool half = (y / 4) % 2; // 0 = upper half, 1 = lower half

      for(uint8_t colorIdx = 0; colorIdx < 4; colorIdx++) {
        uint16_t brightness = (pixelColor >> (8 * colorIdx)) & 0xFF;
        brightness = gammaTable[brightness];
        uint8_t bitToSet =  1 << (half * 4 + (3 - colorIdx));

        for(uint16_t pwmStep = 0; pwmStep < PWM_RESOLUTION; pwmStep++) {
          uint16_t pwmIndex = pwmStep * NUM_PIXELS / 2;

          if(brightness & (1 << pwmStep)) {
            dmaBuf[pwmIndex + matrixIndex] |= bitToSet;
          }
          else {
            dmaBuf[pwmIndex + matrixIndex] &= ~bitToSet;
          }
        }
      }
    }
  }
}

void UART_Printf(const char* fmt, ...) {
  char buf[512];
  va_list args;
  va_start(args, fmt);
  vsnprintf(buf, sizeof(buf), fmt, args);
  HAL_UART_Transmit(&RX_UART, (uint8_t*)buf, strlen(buf), 1000);
  va_end(args);
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef* huart) {
  if(huart == &RX_UART) {
    for(uint8_t i = 0; i < UART_BUFFER_LENGTH; i++) {
      if(uartRxCounter == 0) { // packet preamble
        if(uartBuffer[i] != UART_PROTOCOL_INIT) { //when received packet does not match preamble
          uartRxCounter--; // wait for next
        }
      }
      else {
        uint16_t byteId = (uartRxCounter - 1);
        uint8_t val = uartBuffer[i];
        switch(byteId % 3) {
          case 0: frameBuf[byteId / 3] &= 0x0000FFFF; frameBuf[byteId / 3] |= (val << 24 | val << 16); break;
          case 1: frameBuf[byteId / 3] &= 0xFFFF00FF; frameBuf[byteId / 3] |= val << 8; break;
          case 2: frameBuf[byteId / 3] &= 0xFFFFFF00; frameBuf[byteId / 3] |= val; break;
        }
      }

      uartRxCounter++;
      if(uartRxCounter >= (NUM_PIXELS * 3) + 1)
        uartRxCounter = 0;
    }
  }
}

void startDMA() {
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, 1);

