opendata-heilbronn/modLED/STM32/Src/main.c
  uint32_t dmaBufPos = (uint32_t)dmaBuf + (pwmStepIdx * (NUM_PIXELS / 2));

  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, 0);

  if(HAL_DMA_GetState(DMA_TIMER.hdma[TIM_DMA_ID_CC1]) == HAL_DMA_STATE_BUSY) {
    HAL_GPIO_TogglePin(PIN_LED);

    // DMA_TIMER.Instance->RCR = DMA_TIMER.hdma[TIM_DMA_ID_CC1]->Instance->CNDTR / 2;

    // if(HAL_TIM_PWM_Start(&DMA_TIMER, DMA_CHANNEL) != HAL_OK) {
    //   _Error_Handler(__FILE__, __LINE__);
    // }

    // return;
  }

  if(HAL_DMA_Start_IT(DMA_TIMER.hdma[TIM_DMA_ID_CC1], dmaBufPos, (uint32_t)&GPIOA->ODR, (NUM_PIXELS / 2)) != HAL_OK) {
    // _Error_Handler(__FILE__, __LINE__);
  } 

  uint16_t prescaler = (MIN_PWM_PRESCALER << pwmStepIdx) - 1;
  __HAL_TIM_SET_PRESCALER(&DMA_TIMER, prescaler);
  __HAL_TIM_SET_PRESCALER(&LATCH_TIMER, prescaler);


  if(HAL_TIM_PWM_Start(&DMA_TIMER, DMA_CHANNEL) != HAL_OK) {
    _Error_Handler(__FILE__, __LINE__);
  }
  HAL_TIM_PWM_Start(&LATCH_TIMER, LATCH_CHANNEL);
}


void dataTransmittedHandler(DMA_HandleTypeDef *hdma) {
  //pwmStepIdx = 0;
}

void transmitErrorHandler(DMA_HandleTypeDef *hdma) { 
  __HAL_TIM_DISABLE(&DMA_TIMER); 
}

void ISR_TIM2() {

}

void spiStart() {
  __HAL_SPI_ENABLE(&ETH_SPI);
}

void spiStop() {
  // while(__HAL_SPI_GET_FLAG(&ETH_SPI, SPI_SR_BSY)); //maybe needed, dunno
  __HAL_SPI_DISABLE(&ETH_SPI);
}

void spiWrite(uint8_t* buf, uint16_t len) {
  HAL_SPI_Transmit(&ETH_SPI, buf, len, HAL_MAX_DELAY);
}

void spiRead(uint8_t* buf, uint16_t len) {
  HAL_SPI_Receive(&ETH_SPI, buf, len, HAL_MAX_DELAY);
}

void spiWriteByte(uint8_t byte) {
  spiWrite(&byte, 1);
}

uint8_t spiReadByte() {
  uint8_t byte;
  spiRead(&byte, 1);
  return byte;
}


void generateMAC(uint8_t* macArray) {
  uint32_t uid[3];
  HAL_GetUID(uid);
  macArray[0] = 0x42;
  macArray[1] = (uid[0] >> 0) & 0xFF;
  macArray[2] = (uid[0] >> 8) & 0xFF;
  macArray[3] = (uid[0] >> 16) & 0xFF;
  macArray[4] = (uid[0] >> 24) & 0xFF;
  macArray[5] = (uid[1] >> 0) & 0xFF;
}

volatile bool ipAssigned = false;

void cbkIPAssigned() {
  UART_Printf("IP assigned!\n");
  ipAssigned = true;
}

void cbkIPConflict() {
  UART_Printf("ERROR: IP conflict!\n");
}

//unused and untested for now
void doDHCP() {
  UART_Printf("Beginning DHCP...\n");
  uint8_t dhcp_buffer[1024];
  wiz_NetInfo netInfo = {
    .dhcp = NETINFO_DHCP
  };
  generateMAC(netInfo.mac);

  setSHAR(netInfo.mac);

  DHCP_init(SOCKET_DHCP, dhcp_buffer);

  reg_dhcp_cbfunc(cbkIPAssigned, cbkIPAssigned, cbkIPConflict);

  //should probably be called in main loop, but test for now if it even works at all
  uint32_t repeats = 10000;
  while(!ipAssigned && repeats > 0) {
    DHCP_run();
    repeats--;
  }

  if(!ipAssigned) {
    UART_Printf("ERROR: no IP was assigned in time \n");
    return;
  }

  getIPfromDHCP(netInfo.ip);
  getGWfromDHCP(netInfo.gw);
  getSNfromDHCP(netInfo.sn);
  getDNSfromDHCP(netInfo.dns);

  UART_Printf("IP:  %d.%d.%d.%d\nGW:  %d.%d.%d.%d\nNet: %d.%d.%d.%d\nDNS: %d.%d.%d.%d\n",
    netInfo.ip[0], netInfo.ip[1], netInfo.ip[2], netInfo.ip[3],
    netInfo.gw[0], netInfo.gw[1], netInfo.gw[2], netInfo.gw[3],
    netInfo.sn[0], netInfo.sn[1], netInfo.sn[2], netInfo.sn[3],
    netInfo.dns[0], netInfo.dns[1], netInfo.dns[2], netInfo.dns[3]
  );

  wizchip_setnetinfo(&netInfo);
  
}

void initEthernet() {
  UART_Printf("Initializing Ethernet...");

  // Reset ethernet module. Does not improve communicatoin either...
  HAL_GPIO_WritePin(ETH_RESET_PIN, 0);
  HAL_Delay(1);
  HAL_GPIO_WritePin(ETH_RESET_PIN, 1);
  HAL_Delay(400);
  
  reg_wizchip_cs_cbfunc(&spiStart, &spiStop);
  reg_wizchip_spi_cbfunc(&spiReadByte, &spiWriteByte);
  reg_wizchip_spiburst_cbfunc(&spiRead, &spiWrite);

  uint8_t tx_size[8] = { 2, 2, 2, 2, 2, 2, 2, 2 }; // Device default memory setting
  uint8_t rx_size[8] = { 2, 2, 2, 2, 2, 2, 2, 2 };

  //executes getMAC & the 3 IPs, afterwards writes 00 00 04 80 for reset
  // then setMAC & the 3 IPs, but I don't remember seeing that on the logicanalyzer, maybe because of the NULL pointers instead of 0?
  if(wizchip_init(tx_size, rx_size) < 0) { //initialize with default memory settings
    _Error_Handler(__FILE__, __LINE__);
  } 

  uint8_t mac[6];
  generateMAC(mac);
  setSHAR(mac);

  getSHAR(mac);


  uint8_t ip[4] = { 192, 168, 178, 250 };
  setSIPR(ip); //set client IP

  ip[3] = 1;
  setGAR(ip); //set gateway IP

  memset(ip, 0xFF, 3);
  ip[3] = 0;
  setSUBR(ip); //set subnet mask

  getSIPR(ip);

  UART_Printf(" done. Saved IP: %d.%d.%d.%d\n", ip[0], ip[1], ip[2], ip[3]);
  doDHCP();
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_TIM3_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_SPI2_Init();
  /* USER CODE BEGIN 2 */

  UART_Printf("\nmodLED Matrix Controller starting...\n");

  pwmStepIdx = 0;
  uartRxCounter = 0;

  for (uint32_t i = 0; i < DMA_BUF_LENGTH; i++) {
    dmaBuf[i] = 0;
  }

  for(uint32_t i = 0; i < NUM_PIXELS; i++) {
    //generate test pattern of increasing brightness
    uint8_t c = i * 2;
    // if(i % 2 == 0)
    //   frameBuf[i] = 0xFFFFFFFF;
    frameBuf[i] = c << 24 | c << 16 | c << 8 | c;
  }

  generateGammaTable();
  setGlobalBrightness(INITAL_BRIGHTNESS);
  //initial framebuffer to DMA buffer mapping
  mapFrameBuf();
  

  DMA_TIMER.hdma[TIM_DMA_ID_CC1]->XferCpltCallback = dataTransmittedHandler;
  DMA_TIMER.hdma[TIM_DMA_ID_CC1]->XferErrorCallback = transmitErrorHandler;

  __HAL_TIM_ENABLE_DMA(&DMA_TIMER, TIM_DMA_CC1);
  __HAL_TIM_ENABLE_IT(&DMA_TIMER, TIM_IT_UPDATE);
  
  startDMA();
  
  HAL_TIM_PWM_Start(&PWM_TIMER, PWM_CHANNEL);

  HAL_UART_Receive_DMA(&RX_UART, uartBuffer, UART_BUFFER_LENGTH);

  initEthernet();


